{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "My Dad’s Baked Beans And Mine",
  "page": 101,
  "category": "dinner",
  "serves": "2-4",
  "estimate": "3.00 USD",
  "description": "My dad loves beans in basically any form. This is his formula for the quickest, easiest way to get beans on his plate without missing out on great flavor. Dad’s beans rely on a can of baked beans as the base, while my version uses dried beans you might have left over from another meal. Mine requires a little more cooking and chopping to create the sauce, but comes out even less expensive because of the dried beans. They both taste great, so go with what works best for you: super quick and cheap, or quick and cheaper.",
  "ways": {
    "My Dad's": {
      "ingredients": {
        "required": [
          "2 cans (27 oz) baked beans",
          "2 tbsp mustard",
          "2 tbsp molasses or brown sugar",
          "2 tsp chipotle en adobo, or any chili sauce"
        ]
      },
      "instructions": "If you’re using the chipotle en adobo, chop it finely to be sure the spice will be evenly distributed.\n\nMix all the ingredients into a pot and heat on the stove until the beans are warmed through. Give it a stir and serve. Or do it all in the microwave—works just as well!\n\nServe with rice, or just in a bowl. For an English-style breakfast, try spreading the beans over toast. Or throw them into a burrito, or scramble them with eggs, or stir-fry with onions and bell pepper.\n"
    },
    "Mine": {
      "ingredients": {
        "required": [
          "3 cups dried pinto, red, or black beans, cooked",
          "1/2 cup canned tomatoes, puréed or chopped, with juice",
          "1/4 onion, finely chopped",
          "2 tbsp mustard",
          "2 tbsp molasses or brown sugar",
          "2 tsp chipotle en adobo, or any chili sauce"
        ],
        "variations": [
          "spicy mustard",
          "no chipotle"
        ],
        "toppings": [
          "salsa",
          "scallions",
          "fresh cilantro",
          "avocado",
          "tomato",
          "crumbled bacon",
          "chunks of ham"
        ]
      },
      "instructions": "Cook everything in a pot on medium heat for approximately 5 minutes, or until the juices thicken. That’s it!"
    }
  }
}