{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Beef Stroganoff",
  "page": 105,
  "category": "dinner",
  "serves": 6,
  "estimate": "16.50 USD",
  "description": "Beef stroganoff is one of my husband’s favorites, so I make it as a treat for him—and one of my early readers, Dave, says his mother made it for him growing up. It’s a classic winter meal from Eastern Europe that warms up a cold house and fills the air with rich aroma. You can use any cut of beef; just adjust the cooking time based on the toughness. Dave’s mom made it with red pepper instead of carrot, so feel free to do the same if you can get red peppers at a good price.\n",
  "ingredients": {
    "required": [
      "1 lb beef chuck or other cut",
      "salt",
      "pepper",
      "2 tbsp butter",
      "2 onions, chopped",
      "2 large carrots, chopped",
      "1 tbsp flour",
      "2 tsp paprika",
      "4 cups water",
      "3 cloves garlic, finely chopped",
      "1 lb mushrooms, chopped",
      "1 lb egg noodles",
      "½ cup sour cream",
      "3 tbsp mustard"
    ],
    "additions": [
      "½ cup red wine",
      "potatoes",
      "fresh dill"
    ]
  },
  "instructions": "Chop the raw beef into bite-sized pieces and season generously with salt and pepper.\n\nMelt half the butter in a large saucepan on medium heat. Toss in enough beef to cover the bottom of the pan. You may need to cook the meat in two batches, depending on the size of your pan. Brown the meat on all sides, then set it aside on a plate.\n\nAdd the onions and carrots to the pan and cook until the onions become translucent. Sprinkle with the flour and paprika, then cover with water. Drop the meat back in the pot. Cover the pot with a lid, but leave it askew so the steam can escape. Cook on medium-low heat for 2 hours. This process will make the beef tender and turn the water into beef stock.\n\nIf you’re using a less tough cut of beef, you don’t need to cook nearly as long. Simply brown the meat, then substitute the water for 1 cup of beef stock and cook for 20 minutes. It’s a lot quicker, but of course tender meat is more expensive!\n\nMeanwhile, in another pan on medium heat, melt the rest of the butter. Add the garlic and cook for about a minute. Add the mushrooms and toss to coat them with garlic and butter. Sprinkle with salt and pepper. Let the mushrooms cook about 5 minutes, stirring occasionally, until they brown and shrink. Turn off the heat and taste. Add salt and pepper as needed.\n\nCook the noodles (or any pasta) according to the package instructions. Try to time it to coincide with finishing the stew.\n\nCheck on the beef. If the water has reduced to approximately a cup of thick, flavorful liquid and the beef is tender, it’s done! If not, let it cook a little longer. Once it’s ready, stir in the mushrooms, sour cream, and mustard. Turn the heat down to low to keep it warm until the pasta is ready. Once again, taste and add more salt, pepper, and paprika if needed.\n\nPut the noodles into bowls and top with the stew. Sprinkle a little paprika over top and enjoy!"
}