{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Broccoli, Egg, and Cheddar Empanadas",
  "page": 83,
  "category": "handheld",
  "makes": 12,
  "estimate": "7.20 USD",
  "description": "In case you can’t tell by now, I am partial to tasty dough stuffed with something even tastier. Every culture has its own version, so when you think about it that way, having empanadas, dumplings, perogies, and calzones in one book isn’t that crazy—right? My friend Barb felt the same way, so I created this recipe for her.\n",
  "ingredients": {
    "required": [
      "2 cups all-purpose or whole-wheat flour",
      "½ cup cornmeal",
      "½ tsp salt",
      "¼ cup butter",
      "1 egg",
      "½ cup cold water"
    ],
    "filling": [
      "4 cups broccoli with stems, chopped",
      "1 cup water",
      "9 eggs",
      "2 cloves garlic, finely chopped",
      "½ tsp chili flakes",
      "salt and pepper",
      "1 cup sharp cheddar, grated"
    ]
  },
  "instructions": "Mix the flour, cornmeal, and salt in a large bowl. The cornmeal isn’t traditional in empanadas—I just like the extra crunch it gives. You can substitute more flour for the cornmeal if you like.\n\nPlace the butter in the freezer for 10 minutes, then grate it directly into the flour mixture. Wash and dry your hands, then use them to gently squish the butter into the flour until it looks like bread crumbs.\n\nMake a crater in the flour mixture. Crack the egg into it along with the water. Mix with your hands until it comes together into a smooth ball. If you’re using whole-wheat flour and the dough seems dry, add another tablespoon of water. Cover with plastic wrap or a moist towel.\n\nPut the broccoli and water in a pan over medium heat. Cover it with a lid. Cook for 5 to 7 minutes, until the water is gone and the broccoli is tender.\n\nMeanwhile, crack 8 of the eggs into a bowl, saving the last one for an egg wash later. Mix the eggs with the garlic, chili flakes, salt, and pepper.\n\nOnce the broccoli is tender, pour the eggs into the pan. Stir until just scrambled, about 2 minutes. Turn off the heat, add the cheese, and stir.\n\nHeat the oven to 400 °F. Lightly oil or butter two baking sheets.\n\nDivide the dough into 12 equal pieces and roll each into a ball. Dust your counter lightly with flour, then use a rolling pin to flatten each ball into a thin circle, a little bigger than a DVD. Place some filling on one side of the circle, then fold over the other side to form a half moon. Pinch the edges and place the empanada on a baking sheet. Repeat!\n\nIf you own a pastry brush, an egg wash will make the empanadas shinier. Since it doesn’t affect the taste, only how the empanadas look, this step is very optional. In a small bowl, beat an egg with a fork. Brush the tops of the empanadas with the egg wash.\n\nBake for 20 minutes, until they turn golden brown."
}