{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Broccoli Apple Salad",
  "page": 54,
  "category": "salad",
  "serves": 4,
  "estimate": "3.20 USD",
  "description": "The bitterness of broccoli is delicious next to the sweet tartness of apples. Plenty of crunch, too!\n",
  "ingredients": {
    "required": [
      "1 large crown and stem of broccoli",
      "2 apples"
    ],
    "dressing": [
      "1 lemon, juiced",
      "1 tbsp olive oil",
      "salt and pepper"
    ],
    "alternate dressing": [
      "1 tbsp yogurt",
      "1 tsp olive oil",
      "1 tsp lemon juice",
      "1 tsp fresh dill, chopped",
      "salt and pepper"
    ]
  },
  "instructions": "Slice the stem of the broccoli into 1/8” discs. If you can’t get them that thin, don’t worry, but the thinner the better if you have the patience! Once you reach the crown of the broccoli, cut each of the florets off and slice each of them as thinly as you can as well. Set the broccoli in a bowl.\n\nHalve and core the apples, then place the apples flat side down on your cutting board to make them easier to slice. Slice the apples into 1/8” pieces as well, then dump them into the same bowl.\n\nChoose either of the dressing options and prepare it by simply mixing the ingredients together in a small bowl. Taste it and season with more salt and pepper to match your preferences.\n\nPour the dressing over the bowl of vegetables and mix it all together.\n\nIf you put a plate in the fridge for 10 minutes before serving the salad, it’ll stay crisp slightly longer. For the best presentation, pile the salad as high and tight as you can manage."
}