{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Chana Masala",
  "page": 93,
  "category": "dinner",
  "serves": 2,
  "estimate": "3.00 USD",
  "description": "This Indian chickpea dish is a staple in my home. If you don’t have cooked chickpeas around, you can use canned, but it will cost about $1 more.\n",
  "ingredients": {
    "required": [
      "½ tbsp ghee or ½ tbsp butter plus a splash of olive oil",
      "1 tsp cumin seeds",
      "½ cup onion, diced",
      "1 tsp garlic, finely chopped 1 tsp ginger root, grated",
      "½ jalapeño, finely diced",
      "3 tsp coriander powder",
      "1 tsp turmeric",
      "¼ tsp cayenne powder",
      "½ tsp garam masala powder",
      "1 tsp smoked paprika",
      "½ tsp salt",
      "1 cup canned tomatoes, puréed",
      "2½ cups cooked chickpeas, drained",
      "½ cup water"
    ],
    "garnish": [
      "fresh cilantro",
      "yogurt"
    ]
  },
  "instructions": "Measure out all the spices except the cumin seeds and put them in a small bowl.\n\nLet the ghee (clarified butter) melt in a small saucepan over medium-low heat. (Ghee is the traditional Indian choice, but you can substitute butter and a splash of olive oil if you can’t find ghee.) Once the ghee begins to sizzle, add the cumin seeds and stir for about 5 seconds. Add the onion and sauté for 2 minutes. Add the garlic and cook for 1 minute. Add the ginger and jalapeño and cook for 1 more minute. Add the spices and then the puréed tomatoes. Mix, then put a lid on the pan and let everything cook down for 5 to 10 minutes.\n\nOnce the tomato has reduced and the ghee starts to separate from the sauce, add the chickpeas and water. Mix, then bring it to a boil before reducing to a simmer. Cook for 10 minutes, then squish a few chickpeas with a spoon to thicken the sauce. Garnish with yogurt and cilantro. For a full meal, serve over rice or with roti."
}