{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Cold (and Spicy?) Asian Noodles",
  "page": 50,
  "category": null,
  "serves": 4,
  "estimate": "USD",
  "description": "On a hot day, this is all I want to eat. Cold but spicy food is refreshing and delicious in the summer. If you have some spice oil on hand, be sure to add it. It’s amazing in this.\n",
  "ingredients": {
    "required": [
      "12 oz dried spaghetti, soba, or any Asian noodles",
      "2 tbsp soy sauce",
      "1 bunch scallions, chopped",
      "1 cucumber, finely chopped",
      "salt",
      "pepper"
    ],
    "additions": [
      "spice oil (p. 162)",
      "peanut sauce (p. 161)",
      "grated carrot",
      "shredded cabbage",
      "bean sprouts",
      "hard-boiled egg",
      "chopped tomato"
    ]
  },
  "instructions": "Prepare the noodles according to the package instructions. Rinse them under cold water and put them in a colander to drain.\n\nPut the noodles in a bowl and add the soy sauce, spice oil if you have it, scallions, and cucumber (and any other additions). Mix it all together with a fork or a tongs. Taste it and add salt and pepper or more spice oil as needed.\n\nLet the noodles sit in the fridge for about an hour if you can. The flavors will mingle and become more intense.\n\nThink of this as a recipe that you can really make your own. Use whatever sauce or dressing you like and whatever vegetables you have around, or just a few scallions."
}