{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.\n",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Corn Soup",
  "page": 36,
  "category": "soup",
  "serves": "4-6",
  "estimate": "5.00 USD",
  "description": "This thick, sweet, satisfying soup is a favorite of kids and adults. This is wonderful to make at the beginning of autumn when corn on the cob is at its peak, but canned corn can also make it a warm reminder of summer in the depths of winter.\n",
  "ingredients": {
    "required": [
      "4 cups corn, fresh, canned, or frozen",
      "1 tbsp butter",
      "1 onion, finely chopped",
      "2 sticks celery, finely chopped",
      "1 green or red bell pepper, finely chopped",
      "1 small potato, diced",
      "4 cloves garlic, finely chopped",
      "1 chili pepper, finely chopped (optional)",
      "1 tbsp cornmeal or flour",
      "salt",
      "pepper"
    ],
    "corn broth": [
      "4 to 8 cobs corn, with corn removed",
      "2 bay leaves (optional)",
      "salt"
    ],
    "alternate broth": [
      "5 cups vegetable broth or chicken stock"
    ]
  },
  "instructions": "If you’re making this soup with corn on the cob, the first step is to make corn broth. If you’re using canned or frozen corn, you’ll also need chicken or vegetable broth instead. In that case, skip the next paragraph.\n\nTo make corn broth, place the cobs and bay leaves in a large stockpot and cover with water. Bring to a boil over high heat, then turn the heat down to medium and let the water boil for about 30 minutes. Taste the broth and add salt and pepper until it tastes lightly corny. Boil it down until you have about 5 cups of liquid. The broth will keep for several months if frozen, or a few weeks in the refrigerator.\n\nTo make the soup, melt the butter in a large pot or Dutch oven on medium heat. Add onion, celery, bell pepper, and potato, then stir. Cover the pot and let everything fry and steam for about 5 minutes.\n\nTake the lid off the pot and add the garlic and chili pepper, if using. Stir the vegetables, using a splash of water or broth to free any that get stuck to the bottom of the pot.\n\nLet the vegetables cook, stirring occasionally, for another 5 minutes. They should be lightly browned and soft, although the potatoes will not be fully cooked yet.\n\nAdd the corn and cornmeal or flour to the pot and stir. Cover with about 5 cups of broth and bring to a boil, then turn the heat down to low and simmer for about 30 minutes. The broth will thicken and become opaque.\n\nAdd salt and pepper to taste. If you made your own corn broth, you’ll probably need at least a teaspoon of salt; if you used store-bought broth, you’ll need less.\n\nServe with a slice of garlic bread or add a hard-boiled egg for extra protein."
}