{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Dal",
  "page": 35,
  "category": "soup",
  "serves": 4,
  "estimate": "2.40 USD",
  "description": "This thick lentil soup is a flavor-packed staple of the Indian table. There are a ton of ways to prepare dal, but the core—beyond the lentils themselves—is usually ginger, garlic, and chili, along with some dry spices.\n",
  "ingredients": {
    "required": [
      "2 cups lentils",
      "1 tbsp butter",
      "1 onion, finely chopped",
      "1 tsp cumin seeds",
      "1 tsp black mustard seeds",
      "1 tsp turmeric powder",
      "2 cloves garlic, finely chopped",
      "1 green chili, finely chopped",
      "½ inch ginger root, grated",
      "salt",
      "pepper"
    ]
  },
  "instructions": "You can use any type of lentil you like. If you’re using larger lentils (like chana dal, french lentils, or split mung beans), soak them for 30 minutes to start. If you’re using the small orange lentils, then don’t bother soaking them; they cook very quickly.\n\nMelt butter in a saucepan on medium heat. Add the onion and let it cook for 1 minute, then add the cumin and mustard seeds and stir them around with the onions until they sizzle. Toss in the turmeric powder, garlic, and chili and cook for 3 to 4 more minutes. Add the ginger root and stir fry quickly for about 30 seconds.\n\nAdd the lentils along with enough water to cover them, then place a lid on top. Let everything cook for 20 to 45 minutes, or until the lentils are tender. Taste the dal and add salt and pepper. You’ll probably need a fair bit of salt to bring out all the flavors—a teaspoon or so.\n\nIf you have them available, top the dish with a splash of cream or some chopped fresh cilantro."
}