{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.\n",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Half-Veggie Burgers",
  "page": 102,
  "category": "dinner",
  "serves": 8,
  "estimate": "7.20 USD",
  "description": "When a reader named Quinn suggested a recipe that used both lentils and meat, I started thinking about how veggie burgers and beef burgers each have their own strengths. Why not combine the two ideas to create a burger with meaty flavor but the lean protein and low cost of lentils? And so I offer you the half-veggie burger. May it rest a little lighter in your belly.\n",
  "ingredients": {
    "required": [
      "3 cups lentils or beans, cooked",
      "1 cup bell pepper or other vegetable, finely chopped",
      "1 lb ground beef or other ground meat",
      "salt",
      "pepper",
      "8 buns"
    ],
    "optional": [
      "1 egg"
    ]
  },
  "instructions": "You can use almost any vegetable to make these burger patties, except lettuce and other greens. If you pick a hard vegetable like potato, squash, or eggplant, you’ll need to cook it first.\n\nRoughly mash the lentils. Make sure the vegetables are either small to begin with (like corn or peas) or finely chopped so that they cook evenly. I went for a bell pepper this time.\n\nMix the lentils, veggies, and meat with your hands in a large bowl. If you’re going to barbecue, add an egg to keep them from crumbling. Season with salt and pepper. Form into 8 patties.\n\nGrill the patties either on the barbecue or a pan on the stovetop over medium-high heat. Sear until dark brown on one side, then flip ’em and do the same on the other side. If you want cheeseburgers, lay cheese on the patties after flipping them once.\n\nServe on toasted buns with your favorite condiments and fresh vegetables. Burgers are a great place to be adventurous!\n\nIf you won’t eat all the burgers at once, wrap the raw patties in dinner plastic. Refrigerate for a few days or freeze for up to 2 weeks."
}