{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Kale Salad",
  "page": 44,
  "category": "salad",
  "serves": "2-4",
  "estimate": "4.50 USD",
  "description": "This kale is treated like romaine lettuce in a Caesar salad. The bitterness of the greens is delicious alongside the rich, fatty dressing. You could also use Swiss chard. If you’re worried about the raw egg yolk in the dressing, feel free to omit it.\n",
  "ingredients": {
    "required": [
      "1 large bunch kale",
      "2 cups bread cubes",
      "2 tbsp butter (more as needed)",
      "salt and pepper",
      "Romano or Parmesan, freshly grated"
    ],
    "dressing": [
      "1 egg yolk, raw, from a high-quality fresh egg",
      "2 tsp lemon juice",
      "2 tsp Dijon mustard",
      "1 clove garlic, finely grated (optional)",
      "1 anchovy, finely chopped (optional)",
      "3 tbsp olive oil",
      "salt and pepper"
    ]
  },
  "instructions": "Start by making croutons (p. 146).\n\nTo make the dressing, drop the egg yolk into a large mixing bowl. Add the lemon juice, mustard, garlic, and anchovy. Whisk briskly until the dressing is light and frothy. Slowly add the olive oil, whisking the whole time. Once everything is incorporated, add the salt and pepper, then adjust to your taste. I like it very lemony.\n\nCut the kale leaves to remove the large stem from the center. (Lacinato kale, sometimes called Tuscan kale, has the easiest stems to remove.) Slice the leaves in half lengthwise, then cut into thin ribbons. Chopping the kale into small pieces disguises its tough texture.\n\nToss the kale in the bowl to coat it with dressing. Set aside for 10 minutes or leave in the fridge for a few hours. The kale will become tender as it marinates.\n\nBefore serving, toss in the croutons and top with Romano cheese."
}