{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Omelette",
  "page": 17,
  "category": "breakfast",
  "serves": 2,
  "estimate": "1.60 USD",
  "description": "I make this omelette at least once a week. It’s insanely delicious, whether laden with veggies or kept simple. I love it with dill, but it’s good with almost any herb or scallions. Once you are a pro at making this, add any other cooked veggies you have around.\n",
  "ingredients": {
    "required": [
      "4 eggs",
      "2 tbsp fresh dill, finely chopped",
      "salt",
      "pepper",
      "butter for the pan",
      "1 shallot or ½ small red onion, finely diced",
      "¼ cup grated cheese"
    ]
  },
  "instructions": "Crack the eggs in a bowl. Add the dill, salt, pepper, and beat with a fork.\n\nPut a big saucepan on medium-high heat. Melt a small blob of butter in the pan. Once the butter is sizzling, add the onion and sauté for about two minutes, until it’s translucent and smells great.\n\nAdd the egg to the hot pan and swirl it around to coat the surface evenly. If the center of the omelette cooks more quickly than the edge, use a spatula to pull any raw egg into the middle. Then stop touching it.\n\nAfter about 30 seconds, toss the cheese on top along with any other raw or cooked vegetable you feel like adding. Once none of the egg remains translucent, fold the omelette in half with your spatula, then lift it out of the pan. You don’t want any brown on your eggs.\n\nIf I’m serving two people, I usually cut one large omelette in half rather than making two omelettes. However, when you feel like being fancy, you can make a pair of two-egg omelettes simply by using half the ingredients for each. For extra fanciness, roll up the omelette instead of folding it—that’s how the French do it, traditionally. The result will be quite thin and tender."
}