{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Pasta with Eggplant and Tomato",
  "page": 90,
  "category": "dinner",
  "serves": 2,
  "estimate": "5.00 USD",
  "description": "This is similar to a traditional pasta alla norma, but without anchovies and ricotta salata. I like to use a tubular pasta for this dish, but you can use anything, even spaghetti. The eggplant and tomatoes come together into a sauce that is thick and jammy and savory.\n",
  "ingredients": {
    "required": [
      "1/2 lb pasta (rigatoni or similar)",
      "2 tbsp olive oil",
      "1 large eggplant, cubed",
      "4 cloves garlic, finely chopped",
      "1/2 tsp chili flakes",
      "2 cups canned tomatoes, finely diced",
      "1/4 cup Romano or Parmesan, freshly grated",
      "salt",
      "pepper",
      "fresh basil, finely chopped (optional)"
    ]
  },
  "instructions": "Put a pot of water on high heat and add a good shake of salt. Bring it to a boil and cook the pasta according to the package instructions.\n\nWhile the water is coming to a boil, splash the olive oil into a wide pan on medium-high heat. Let it get hot. Add the eggplant cubes and sprinkle them with salt, then cook for about 5 minutes. If the eggplant starts to look too dry, add a bit of water.\n\nOnce the cubes are a little brown on all sides, add the garlic and chili flakes and stir. Add the tomatoes and cook for about 15 minutes, stirring occasionally. Again, if it looks too dry, add a bit of water. Everything will shrink up and become a sort of loose, thick sauce. Add half the cheese and half the basil, if you have it.\n\nOnce the pasta is cooked, drain it and add it to the saucepan. Toss everything together, then turn off the heat. Add salt and pepper to taste.\n\nServe it in bowls sprinkled with more Romano and basil."
}