{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.\n",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Peanut Butter and Jelly Granola Bars",
  "page": 25,
  "category": "breakfast",
  "makes": 12,
  "estimate": "3.60 USD",
  "description": "Tired of endless PB+J sandwiches? Give these bars a try instead! I designed them for my friend Alex, who is allergic to gluten and is the best long-distance runner I know. I wanted to create a simple but nutritious breakfast that he could grab on his way out for a run. They are a little more crumbly than a store-bought granola bar, however.\n\nAs a bonus, these are made entirely from ingredients that you can find in any corner store or food pantry. Any kind of jam or jelly will do; I used blueberry, but grape or strawberry or any other flavor would be tasty.\n",
  "ingredients": {
    "required": [
      "3 cups rolled oats (or 2 cups oats and 1 cup Rice Krispies)",
      "1/2 cup peanut butter",
      "1/2 cup jelly or jam",
      "1/4 cup hot water",
      "1/4 tsp salt",
      "butter or vegetable oil"
    ],
    "additions": [
      "nuts",
      "coconut",
      "dried fruit",
      "honey"
    ]
  },
  "instructions": "Heat the oven to 350 °F.\n\nButter or oil an 8\" x 11\" baking pan. If you have a different size pan, that’s fine—it’ll just change how thick the bars are.\n\nPour the oats into a large bowl. You can use quick oats if they’re all you have, but I prefer the bite and chew of rolled oats. For a different texture, you can also substitute a cup of oats with a cup of Rice Krispies, but the bars are great either way.\n\nAdd the peanut butter, half the jelly, the water, and the salt to a small pan. Stir over low heat until it’s smooth.\n\nMix the peanut butter and jelly concoction into the oats until all the oats are coated and you have a sticky mass. Dump the mixture into the oiled pan and press it into an even layer. Spread the remaining jelly over the top.\n\nPop the pan into the oven for 25 minutes, until it’s toasty and brown around the edges. Mmm. Crunchy.\n\nLeave the bars in the pan until they cool completely, about an hour, then slice into 12 bars."
}