{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.\n",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Pizza Dough",
  "page": 139,
  "category": "staples",
  "makes": 4,
  "estimate": "0.80 USD",
  "description": "There are two ways to make pizza dough: the fast way and the slow way. They’re the same amount of work, just with different waits. The slow method is convenient for a weekday if you make it before bed the night before, pop it in the fridge, then pull it out to rise before dinner.\n",
  "ingredients": {
    "required": [
      "3 cups all-purpose or bread flour",
      "1 1/2 tsp salt",
      "1/2 to 1 tsp instant yeast",
      "1 tbsp olive oil",
      "1 1/4 cup water"
    ]
  },
  "instructions": "# Fast Method \n\nMeasure out the flour, salt and a teaspoon of yeast into a big bowl. Mix the oil into the flour with your hands, crumbling it until the texture is a bit sandy, then add the room-temperature water. Keep mixing with your hands until it comes together.\n\nKnead the dough on a lightly floured countertop for 5 to 7 minutes, until it becomes a smooth elastic ball. The dough will be smooth but quite wet.\n\nAdd a small amount of oil to a bowl. Place your dough ball in the bowl and cover with plastic wrap. Let it rise for 1 1/2 to 3 hours, depending on the warmth of your kitchen. It’s done rising when it has doubled in size. Then it’ll be ready to shape into your favorite pizza!\n\n# Slow Method\n\nIf you’re organized enough to make the slow dough, I recommend taking the extra time: it’s the best.\n\nUse the same process as [the fast method], but add only 1/2 teaspoon of yeast to the flour mixture. Rather than room temperature, the water should be very cold.\n\nAfter you place the dough ball in a bowl and cover it, put it into the fridge overnight. Letting the yeast work overnight creates a better flavor; it also makes the dough more elastic and easier to work with. \n\nThe next day, 2 to 3 hours before you want to bake your pizzas, remove the dough from the fridge to return to room temperature."
}