{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Shrimp and Grits",
  "page": 117,
  "category": "dinner",
  "serves": 4,
  "estimate": "12.00 USD",
  "description": "The cost of shrimp has jumped sharply since I wrote this recipe, so save this one until you can find a deal—under about $8 per pound. This is far from an authentic Southern version of this dish, but it is absolutely delicious. Southerners will demand you use white stone-ground corn for this, and I won’t quibble, but feel free to use yellow if it doesn’t offend you.\n",
  "ingredients": {
    "grits": [
      "1 cup grits",
      "4½ cups vegetable or chicken stock",
      "½ cup sharp cheddar, grated",
      "3 scallions, finely chopped"
    ],
    "topping": [
      "1 lb shrimp, peeled and deveined",
      "1 tbsp butter or vegetable oil",
      "1 medium onion, chopped",
      "1 bell pepper, chopped",
      "2 sticks celery, chopped",
      "2 cloves garlic, finely chopped",
      "1 tomato, chopped"
    ],
    "optional": [
      "1 green chili, finely diced"
    ]
  },
  "instructions": "Bring the stock to a boil in a medium-sized pot, then turn the heat down to low and slowly pour in the cornmeal while stirring briskly with a wooden spoon. Stirring while pouring is crucial to keep the grits creamy and smooth—no lumps! Once the grits become smooth and thick, place a lid on the pot with the spoon still in it so that steam can escape.\n\nLet the grits cook while you prepare the rest of the meal, checking in occasionally to give them a stir. The total cooking time should be about 25 to 30 minutes.\n\nMeanwhile, prepare the shrimp and vegetables. Add the butter or oil to a large pan on medium heat and let it get hot. Add the onion, pepper, and celery. Sauté until the onion is just translucent, about 2 minutes. Add the garlic, as well as the green chili if you like things spicy. Let everything cook for another minute. Add the tomato and cook for 3 or 4 minutes, until the tomato releases its juice and the vegetables resemble a thick and chunky sauce. Add a dribble of water to keep everything loose and saucy, then toss in the shrimp. Cook, stirring occasionally, until the shrimp are pink all over. Add salt and pepper to taste.\n\nOnce the grits are ready, take them off the heat and add the cheese and most of the scallions, then stir. Ladle the grits into bowls and top with the shrimp, vegetables, and a few more scallions."
}