{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Spicy, Crunchy, Creamy Polenta",
  "page": 118,
  "category": "dinner",
  "serves": 2,
  "estimate": "3.50 USD",
  "description": "Polenta plus vegetable plus egg equals satisfying and delicious. You can also add a can of corn to the polenta for deep, rich, corny flavor. Or go a little different by adding frozen peas, scallions, olives, or (my favorite) green chilies to the polenta. Or skip the Romano and add 1/4 cup of grated cheddar to the polenta.\n",
  "ingredients": {
    "required": [
      "1/2 cup polenta or cornmeal",
      "2 cups water",
      "1/2 tsp salt",
      "1 tbsp olive oil",
      "4 cups fresh spinach or 1 cup frozen spinach, roughly chopped",
      "3 cloves garlic, finely chopped",
      "1/2 tsp chili flakes (or fresh chili)",
      "2 eggs",
      "Romano or Parmesan, freshly grated",
      "salt",
      "pepper"
    ],
    "optional": [
      "1 anchovy, finely chopped"
    ]
  },
  "instructions": "Bring the water and salt to a boil in a medium-sized pot, then turn the heat down to low and slowly pour in the polenta while stirring briskly with a wooden spoon. Stirring while pouring is crucial to keep the polenta creamy and smooth—no lumps! Once the cornmeal becomes smooth and thick, place a lid on the pot with the spoon still in it so that steam can escape.\n\nLet the polenta cook while you prepare the rest of the meal, checking in occasionally to give it a stir. The total cooking time should be about 25 to 30 minutes, but if you’re in a rush, you can eat it after 15.\n\nMeanwhile, chop the spinach, garlic, and anchovy if you’re using it. Set them aside. Add a bit of olive oil or butter to a pan on medium heat. Let the pan heat up until it sizzles when you flick it with water. Add the garlic, anchovy, and chili flakes. Let them cook until you can smell them, about 1 minute. Add the spinach and toss it around with a spoon or tongs, or just swirl the pan to coat the spinach with the garlic mixture. Let everything cook for 3 to 5 minutes, until the spinach is wilted. Remove the pan from the heat and move its contents to a bowl to wait for the polenta and eggs.\n\nWhen the polenta is about 2 minutes from done, start with the eggs. Wipe the pan quickly with a cloth, then put it back on medium heat. Splash a bit more olive oil in the pan and wait for it to get hot. Crack the two eggs into the pan and cover with a lid. This will steam them, making sunny-side-up eggs with fully cooked whites.\n\nScoop the polenta into a pair of bowls. Add some Romano and lots of salt and pepper. Layer about half the vegetables over the polenta.\n\nOnce the whites of the eggs are cooked, remove them from the pan with a spatula and lay them over the polenta and vegetables. Top with the rest of the vegetables and further sprinklings of cheese."
}