{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Spicy Panzanella",
  "page": 49,
  "category": "salad",
  "serves": 4,
  "estimate": "5.20 USD",
  "description": "A former classmate, George, likes salads with a little kick. (As you can maybe tell, I do too!) For inspiration, I turned to panzanella, a classic Italian bread-and-tomato salad. The Italians are true masters of making leftovers delicious. Here, old hard bread soaks up tomato juice and dressing for a super flavorful and filling salad. You can toss in any vegetable or fruit so long as it’s juicy. Bell peppers or carrots won’t work so well, but peaches, grapes, and zucchini all do. If you don’t like spicy salads as much as George and I do, feel free to replace the jalapeño with garlic or shallot.\n",
  "ingredients": {
    "required": [
      "2 small field cucumbers or 1 English cucumber, chopped",
      "2 medium tomatoes, chopped",
      "salt",
      "pepper",
      "4 slices day-old bread"
    ],
    "dressing": [
      "1 jalapeño, finely chopped",
      "2 tbsp tomato, chopped",
      "1 lime, juiced",
      "2 tbsp olive oil",
      "salt",
      "pepper"
    ],
    "additions": [
      "fresh herbs",
      "peaches, nectarines, or plums",
      "red onion, finely chopped",
      "zucchini or summer squash",
      "olives",
      "grapes"
    ]
  },
  "instructions": "If you’re using field cucumbers—usually much less expensive than English cucumbers—peel them roughly to remove the tough skin.\n\nKeep about 2 tablespoons of chopped tomatoes aside to use in the dressing, but throw the rest of the tomatoes and all the cucumbers into a large bowl. Sprinkle generously with salt and pepper; the salt helps draw out the juices. Toss the vegetables quickly.\n\nPlace a small saucepan on medium heat with a few drops of olive oil. Sauté the jalapeño for about a minute, then add the remaining tomato and a tablespoon of water. Cook for another 2 minutes, until the tomato juices release. Sprinkle liberally with salt and pepper.\n\nOnce the water has evaporated, turn off the stovetop and dump the jalapeño-tomato mixture on your cutting board. Chop it very finely, then throw it back into the pan—with no heat—along with the lime juice and olive oil. Taste it and add more salt and pepper as needed. You’ve got dressing!\n\nChop or tear the bread into bite-sized pieces, then toast it in a skillet over medium heat, tossing occasionally until the bread chunks are toasty on all sides. Alternatively, just toast full slices of bread in a toaster and tear them up afterwards, or skip the toasting entirely if the bread is already super-hard.\n\nMix the bread and vegetables with the dressing. Taste and adjust salt and pepper once more.\n\nLet it sit for a few minutes so that the bread can soak up the juices, then serve!"
}