{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Things On Toast",
  "page": 69,
  "category": "bites",
  "serves": 2,
  "estimate": "1.50 USD",
  "description": "I love bread, and toast in particular is my comfort food—I crave it when I’m sick or worn down. Here, I would like to suggest that you take some toast and put something tasty on it. That’s it!\n\nCertainly toast can feed a crowd, but I like this meal for times when I’m on my own and want a quick meal or snack. It’s a great way to use leftovers or turn a side dish into a full meal.\n\nWhat makes this more like a special dinner than a quick snack is the way you treat the bread—toasting it in the pan like a nice piece of fish.\n\nA pile of sautéed or raw veggies over buttered, toasty bread is the perfect meal for one and a great way to try a new vegetable. I’ve suggested a few other toast variations on the following pages, but you can use pretty much any veggie dish from this book or invent your own. Add a fried egg on top if you’re extra hungry.\n",
  "ingredients": {
    "required": [
      "4 slices bread",
      "2 tbsp butter",
      "salt and pepper",
      "topping"
    ],
    "optional": [
      "fried egg"
    ]
  },
  "instructions": "Melt ½ tablespoon of butter in a small pan on medium heat. Place the two slices of bread in the pan and let them cook for about 2 minutes, then lift them with a spatula to check whether they’re golden brown underneath. When they are, flip ’em over.\n\nAdd the rest of the butter to the pan to make sure the second side of the toast becomes just as golden as the first. Sprinkle the top of the bread with salt and pepper. Once the second side is golden, set the bread on a plate to await its topping.\n\nFor the toppings, you can go raw or, as I most often do, sauté veggies or beans with flavors like garlic and chilies, olives and and dill, ginger and turmeric, or any other classic combination (p. 166).\n\nInstead of toast, the topping ideas on the next few pages would also be great over rice or any other grain, in a tortilla, tossed with pasta, or even on a pizza. It’s up to you!\n",
  "ways": {
    "peas and lemon": {
      "page": 70,
      "estimate": "2.00 USD",
      "ingredients": {
        "required": [
          "1 tsp olive oil",
          "2 cloves garlic, finely chopped",
          "1 cup peas, fresh or frozen",
          "1 tsp lemon juice",
          "Romano or Parmesan, freshly grated",
          "salt and pepper"
        ]
      },
      "instructions": "This is like a less-salty, more-rustic version of the British classic mushy peas. Add a bit of olive oil to a pan on medium heat. Drop in the garlic and peas along with 2 tablespoons of water so that the peas can steam a bit. Leave them until they turn bright green. Sprinkle with lemon juice, Romano, salt, and pepper, then remove the peas from the heat and mash with the back of a fork, either in the pan or in a bowl. Pile onto toast and enjoy!"
    },
    "asian greens gra prow": {
      "page": 70,
      "estimate": "5.00 USD",
      "ingredients": {
        "required": [
          "1 bunch Asian greens, stem separated from leaves",
          "1 tsp vegetable oil",
          "2 cloves garlic, finely chopped",
          "1 tsp ginger root, grated",
          "2 tsp soy sauce",
          "1 handful Thai basil salt and pepper"
        ]
      },
      "instructions": "This works with any Asian green, from bok choy to tatsoi to gai lan. Splash the oil in a pan on medium heat. Sauté the garlic for 2 minutes, then add the ginger, soy sauce, and the stem part of the greens. Cook for 4 to 5 minutes, until almost tender. Add the leafy part of the greens and cook for 2 more minutes. Turn off the heat and mix in the Thai basil. Taste and add salt and pepper, unless the soy sauce is salty enough on its own."
    },
    "caramelized onions and cheddar": {
      "page": 71,
      "estimate": "2.00 USD",
      "ingredients": {
        "required": [
          "1 tbsp butter",
          "1 red onion, thinly sliced",
          "sharp cheddar, thinly sliced",
          "salt and pepper"
        ]
      },
      "instrunctions": "Melt the butter in a pan on low heat. Add the onions and let them cook slowly, about 20 minutes. As the onions darken, stir them occasionally, adding a bit of water to loosen up the sticky onion bits on the bottom and keep them from burning. Leave the onions until they’re dark purple. They will now be sweet and caramelized. Spread them over toast and top with slices of aged cheddar, salt, and pepper. Put the toast back in the pan and cover with a lid until the cheese is bubbly, then serve it up."
    },
    "roasted vegetables": {
      "page": 71,
      "estimate": 2.0,
      "ingredients": {
        "required": [
          "roasted vegetables (p. 122)",
          "Romano or Parmesan, freshly grated",
          "pepper"
        ]
      },
      "instructions": "This is one of my favorite ways to eat leftover roasted vegetables. Simply create a ridiculously tall pile of vegetables like the winter squash and leeks pictured here, then sprinkle with grated Romano or Parmesan and fresh pepper. You can also add any sauce you have on hand or sprinkle crushed nuts on top."
    },
    "salty broccoli": {
      "page": 72,
      "estimate": "3.00 USD",
      "ingredients": {
        "required": [
          "1 tsp olive oil",
          "3 cloves garlic, finely chopped",
          "1 tsp chili flakes",
          "1 anchovy, finely chopped",
          "1 crown and stem of broccoli, chopped",
          "Romano or Parmesan, freshly grated",
          "salt and pepper"
        ]
      },
      "instructions": "Warm up the oil in a pan on medium heat. Add the garlic and chili flakes and cook for 2 minutes, until they smell great but are not yet brown. Add the anchovy and cook for another minute. Add the broccoli and about ¼ cup of water. Cover the pan, steam for 3 minutes, then toss and cook for 2 minutes, until the broccoli is tender and the water is gone. Spoon onto toast; top with cheese, salt, and pepper!"
    },
    "broiled eggplant salad": {
      "page": 72,
      "estimate": "3.50 USD",
      "ingredients": {
        "required": [
          "broiled eggplant salad (p. 43)",
          "fresh herbs or greens",
          "any cheese, crumbled or grated"
        ]
      },
      "instructions": "Here’s yet another use for leftovers—or just a way to make a great salad more substantial. Simply dollop the broiled eggplant salad onto toast, then add some herbs or greens to the top for a fresh counterpoint, along with a bit of cheese."
    },
    "black-eyed peas and collards": {
      "page": 73,
      "estimate": "2.00 USD",
      "ingredients": {
        "required": [
          "black-eyed peas and collards (p. 94)"
        ],
        "optional": [
          "jalapeño-cheddar scones (p. 22)"
        ]
      },
      "instructions": "Oh man, is there anything more comforting than beans on toast? Friends and family will be delighted even if you’re secretly using up leftovers. To make the meal a little more fancy, use jalapeño-cheddar scones instead of toast."
    },
    "spinach and chickpea": {
      "page": 74,
      "ingredients": {
        "required": [
          "1 tsp butter",
          "2 cloves garlic, finely chopped",
          "1 cup cooked chickpeas",
          "1 bunch spinach",
          "salt and pepper"
        ],
        "optional": [
          "smoked paprika"
        ]
      },
      "instructions": "This is a popular tapas dish in Spain. The recipe makes a little more topping than you need for two pieces of toast—but hey, leftovers are tasty. Melt the butter in a pan on medium heat. Add the garlic and cook for 2 minutes. Add the chickpeas and spinach, then cook for 2 to 5 minutes, until the spinach cooks down but is still bright green. Taste and add salt and pepper, then spoon it over toast. If you have it, sprinkle with smoked paprika."
    }
  }
}