{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.\n",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Tofu Hot Pot",
  "page": 106,
  "category": "dinner",
  "serves": 4,
  "estimate": "7.20 USD",
  "description": "I got really excited when my friend Iva asked for a recipe that featured the Chinese flavors she grew up with. After all, Chinese cooking depends on the same general principles as Good and Cheap: build bright flavors from a few key ingredients; use lots of veggies and just a little meat or fish. The ginger-garlic broth in this hot pot is spectacular! You can use whatever vegetables you have around, but mushrooms help create an earthy broth. The effect of such a small amount of toasted sesame oil is remarkable, too—an investment, but a transformative flavor.\n",
  "ingredients": {
    "required": [
      "1 tbsp ginger root, finely grated",
      "4 cloves garlic, finely grated",
      "8 cups water",
      "1/2 lb mushrooms, chopped",
      "1 tsp chili paste",
      "2 tbsp soy sauce",
      "2 tsp toasted sesame oil",
      "4 scallions, chopped",
      "16 oz firm tofu",
      "4 medium carrots, chopped",
      "8 oz dried spaghetti, soba, or any Asian noodles"
    ],
    "optional": [
      "bean sprouts"
    ],
    "additions": [
      "additions",
      "chicken, pork, or beef",
      "peanuts, chopped",
      "cabbage, chopped",
      "kimchi",
      "chili peppers",
      "fresh cilantro",
      "daikon radish, sliced"
    ]
  },
  "instructions": "If you have time, freeze the ginger root for an hour before you start. It’s much easier to grate when frozen! Store the rest of the root in the freezer until the next time you need it.\n\nDrop the grated ginger root and garlic into a pot over medium heat. A few seconds later, once you can start to smell the garlic, pour in the water. Bring to a boil, then reduce the heat to low.\n\nAdd the mushrooms, chili paste, soy sauce, and toasted sesame oil. Place a lid on the pot and let simmer for 20 minutes.\n\nSeparate the white and green parts of the scallions. You’ll cook the white and save the green to sprinkle over the soup.\n\nCut the tofu into four slices, then turn each slice into eight squares. Or just chop it up however you like.\n\nAdd the tofu, carrots, and the white parts of the scallions to the broth. Cook about 10 minutes more, until the carrots are tender.\n\nAdd the noodles and keep boiling until they soften, usually just a few minutes, although it depends on the type of noodles.\n\nTaste the broth. If it isn’t salty enough, splash in more soy sauce. Adjust the sesame oil and chili paste to your taste as well.\n\nLadle the soup into bowls. For a little crunch, top with bean sprouts and the green bits of the scallions.\n\nIf you have leftovers, you’ll find you like this soup even more the next day. Overnight, the flavors will infuse into the tofu, as well as combining with each other. You might want to store the noodles separately, though, because otherwise they’ll get soggy."
}