{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Tzatziki",
  "page": 165,
  "category": "flavor",
  "makes": "2 cups",
  "estimate": "3.50 USD",
  "description": "If you’re in a hurry, you don’t have to strain this at all: you can just mix the ingredients together. However, removing the water from the cucumber and yogurt intensifies the flavor. Your patience will be rewarded by a thick sauce that gives you a new perspective on cucumbers.\n",
  "ingredients": {
    "required": [
      "2 cups yogurt",
      "1 large cucumber, grated",
      "1 tsp salt",
      "2 tbsp fresh dill, chopped",
      "2 scallions, finely chopped",
      "salt and pepper"
    ]
  },
  "instructions": "Grate the cucumber and place it in a sieve over a large bowl. Salt the cucumber and mix it around. Leave it for 30 minutes to 2 hours, occasionally pressing the cucumber gently into the sieve to get the liquid out. The salt will help leach the water out of the cucumber.\n\nLine another sieve (or the same one, cleaned) with paper towel or cheesecloth and pour the yogurt into it. You can leave it for as little as 1 hour on the counter or overnight in the fridge. The longer you leave it, the thicker it will get. This is how Greek yogurt is made!\n\nMix the strained cucumber with the yogurt and the other ingredients, then taste. Adjust the salt and pepper and add any more dill or onion.\n\nEnjoy on sandwiches, as a dip, with pita or tortilla chips, or over meatballs, kebabs or anything spicy."
}