{
  "source": {
    "title": "Good and Cheap: Eat Well on $4/Day",
    "attribution": "Text, recipes, and most photographs and design by Leanne Brown, in fulfillment of a final project for a master’s degree in Food Studies at New York University.\n",
    "url": "http://www.leannebrown.com/s/good-and-cheap.pdf",
    "license": {
      "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
      "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
    },
    "modified": "PDF to machine format and other changes"
  },
  "license": {
    "name": "Creative Commons Attribution-NonCommercialShareAlike 4.0",
    "url": "http://www.creativecommons.org/licenses/by-nc-sa/4.0"
  },
  "author": {
    "name": "Leanne Brown",
    "site": "http://www.leannebrown.com"
  },
  "name": "Vegetable Quiche, Hold the Crust",
  "page": 114,
  "category": "dinner",
  "serves": 4,
  "estimate": "6.00 USD",
  "description": "Much as I love this quiche hot, I like it even better cold out of the fridge the next day. It makes a great fast breakfast or lunch. The quiche in the picture uses broccoli, but you can make it with pretty much any kind of vegetable. Some of my favorites are roasted green chilies and cheddar, winter squash with goat cheese, zucchini and tomato, or spinach and olive.\n",
  "ingredients": {
    "required": [
      "1 tbsp butter",
      "1 large onion, sliced into half moons",
      "3-4 cups chopped vegetables",
      "8 eggs",
      "1 cup milk",
      "1 cup cheddar or other cheese, grated",
      "1 tsp salt",
      "1/2 tsp black pepper"
    ]
  },
  "instructions": "Set the oven to 400 °F.\n\nThere are two ways to make this quiche. If you have a cast-iron or other oven-proof skillet, you can make the quiche right in the skillet. This cuts down on dishes. Otherwise, start with a regular skillet and later transfer everything to a pie plate to bake.\n\nMelt the butter in a skillet over medium heat. Add your onion slices and sprinkle a bit of salt and pepper over them. Cook the onions until they are golden brown and starting to caramelize. If your pan is oven-proof, simply remove it from the heat and spread the onions evenly across the bottom. Otherwise, butter a pie plate and scoop the onions into it, creating an even layer on the bottom. The onions add a crust-like texture and a bit of crunch.\n\nA note on vegetables: For things like broccoli, cauliflower or winter squash, I suggest steaming or cooking them before adding them to the quiche to ensure they’ll be fully cooked. For tomatoes, zucchini, spinach or any other quick-cooking vegetable, just use them fresh.\n\nSpread the vegetables evenly over top of the onions. The dish or pan should look fairly full.\n\nIn a bowl, use a fork to lightly beat the eggs with the milk, cheese, salt, and pepper, just enough to break up the yolks and whites. This is a savory custard mixture. Pour the custard over the vegetables and onions and enjoy watching it fill in all the free spaces.\n\nBake the quiche in the oven for 1 hour. Once the surface is lightly brown all the way across, it’s fully cooked.\n\nLet the quiche cool for about 20 minutes, then slice into wedges and serve with a side salad."
}